## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.app will be created
  + resource "azurerm_container_app" "app" {
      + container_app_environment_id  = "/subscriptions/3c686fe4-f5d8-46da-94d4-313a781b59c0/resourceGroups/rg-vscode-privatemktplce/providers/Microsoft.App/managedEnvironments/cae-vscode-privatemktplce"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-vscode-privatemktplce"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-vscode-privatemktplce"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + custom_domain              = (known after apply)
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "registry-password"
          + server               = "mcr.microsoft.com"
          + username             = "test-admin"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + cooldown_period_in_seconds       = 300
          + max_replicas                     = 1
          + min_replicas                     = 1
          + polling_interval_in_seconds      = 30
          + revision_suffix                  = (known after apply)
          + termination_grace_period_seconds = 0

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/vsmarketplace/vscode-private-marketplace:1.0.57"
              + memory            = "1Gi"
              + name              = "vscode-private-marketplace"

              + env {
                  + name  = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + value = (sensitive value)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + container_app_url     = (known after apply)
```
</details>